#include<stdio.h>
#include<stdlib.h>
int main(){


/*
は～～～～～～～最初から書き直しマジしんどい死ねる
どうすんだっけな
問題ファイルと解答ファイルを読み込んで乱数で問題番号を指定して
小学20→中学20→高校10→大学10問
くらいずつ正答したら進める奴がしたい
出来るならタイム計ってもいいかも

ファイル読み込み
int n=0;
 while(n<9){
	乱数生成？
	printf("問題文表示\n");
	scanf(%s,ans);
	if(ans==answer){	入力した解答＝設定されている解答ならnを+してもっかい
	  printf("〇\n");
	  n++;
	}
	else{				違うならnを+しないでもっかい
	  printf("×\n");
	}
 }
ファイルを閉じる
	printf("次の問題へ進みましょう！");
↑を小学生レベル～大学生レベルまで繰り返す感じかな？
ここまでまとめて関数にしちゃった方が綺麗かも
*/








}